src/Documents/Демо_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Демо_Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Демо_КОД_СкладыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Демо_КОД_Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/Демо_КОД_НачальноеЗаполнение/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет начальное заполнение демо-данных версии 1.
Процедура ВыполнитьВерсию1() Экспорт
	
	Категории = ЗаполнитьКатегории();
	Склады = ЗаполнитьСклады();
	Товары = ЗаполнитьТовары(Категории);
	ЗаполнитьПланОбмена(Склады);
	ЗаполнитьЗаказы(Склады, Товары);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает категории товаров, используемые демо-данными.
//
// Возвращаемое значение:
//  Структура - ссылки на созданные категории товаров.
Функция ЗаполнитьКатегории()
	
	Категории = Новый Структура;
	Категории.Вставить("Электроника", ПолучитьИлиСоздатьКатегорию("Электроника"));
	Категории.Вставить("БытоваяТехника", ПолучитьИлиСоздатьКатегорию("Бытовая техника"));
	Категории.Вставить("Инструменты", ПолучитьИлиСоздатьКатегорию("Инструменты"));
	
	Возврат Категории;
	
КонецФункции

// Создает склады, используемые демо-данными.
//
// Возвращаемое значение:
//  Структура - ссылки на созданные склады.
Функция ЗаполнитьСклады()
	
	Склады = Новый Структура;
	Склады.Вставить("Основной", ПолучитьИлиСоздатьСклад("Основной склад"));
	Склады.Вставить("Резервный", ПолучитьИлиСоздатьСклад("Резервный склад"));
	Склады.Вставить("Региональный", ПолучитьИлиСоздатьСклад("Региональный склад"));
	
	Возврат Склады;
	
КонецФункции

// Создает товары, используемые демо-данными.
//
// Параметры:
//  Категории - Структура - ссылки на категории товаров.
//
// Возвращаемое значение:
//  Структура - ссылки на созданные товары.
Функция ЗаполнитьТовары(Категории)
	
	Товары = Новый Структура;
	Товары.Вставить("Ноутбук", ПолучитьИлиСоздатьТовар("Ноутбук", Категории.Электроника));
	Товары.Вставить("Смартфон", ПолучитьИлиСоздатьТовар("Смартфон", Категории.Электроника));
	Товары.Вставить("Кофеварка", ПолучитьИлиСоздатьТовар("Кофеварка", Категории.БытоваяТехника));
	Товары.Вставить("Пылесос", ПолучитьИлиСоздатьТовар("Пылесос", Категории.БытоваяТехника));
	Товары.Вставить("Дрель", ПолучитьИлиСоздатьТовар("Дрель", Категории.Инструменты));
	Товары.Вставить("НаборИнструментов", ПолучитьИлиСоздатьТовар("Набор инструментов", Категории.Инструменты));
	
	Возврат Товары;
	
КонецФункции

// Заполняет текущий и удаленные узлы демо-плана обмена.
//
// Параметры:
//  Склады - Структура - ссылки на склады демо-данных.
Процедура ЗаполнитьПланОбмена(Склады)
	
	ЗаполнитьЭтотУзелПланаОбмена();
	
	СкладыУзла = Новый Массив;
	СкладыУзла.Добавить(Склады.Основной);
	ЗаполнитьУзелПланаОбмена("WEB", "Интернет-магазин", СкладыУзла);
	
	СкладыУзла = Новый Массив;
	СкладыУзла.Добавить(Склады.Резервный);
	ЗаполнитьУзелПланаОбмена("MARKET", "Маркетплейс", СкладыУзла);
	
	СкладыУзла = Новый Массив;
	СкладыУзла.Добавить(Склады.Основной);
	СкладыУзла.Добавить(Склады.Региональный);
	ЗаполнитьУзелПланаОбмена("B2B", "B2B-портал", СкладыУзла);
	
КонецПроцедуры

// Создает заказы, демонстрирующие фильтрацию и маршрутизацию по складам.
//
// Параметры:
//  Склады - Структура - ссылки на склады демо-данных.
//  Товары - Структура - ссылки на товары демо-данных.
Процедура ЗаполнитьЗаказы(Склады, Товары)
	
	СоставЗаказа = Новый Массив;
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.Ноутбук, 1));
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.Смартфон, 2));
	СоздатьЗаказ(Склады.Основной, СоставЗаказа, Истина);
	
	СоставЗаказа = Новый Массив;
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.Кофеварка, 1));
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.Пылесос, 1));
	СоздатьЗаказ(Склады.Резервный, СоставЗаказа, Истина);
	
	СоставЗаказа = Новый Массив;
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.Дрель, 2));
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.НаборИнструментов, 1));
	СоздатьЗаказ(Склады.Региональный, СоставЗаказа, Истина);
	
	СоставЗаказа = Новый Массив;
	СоставЗаказа.Добавить(НоваяСтрокаЗаказа(Товары.Пылесос, 1));
	СоздатьЗаказ(Склады.Основной, СоставЗаказа, Ложь);
	
КонецПроцедуры

// Возвращает существующую категорию по наименованию или создает новую.
//
// Параметры:
//  Наименование - Строка - наименование категории.
//
// Возвращаемое значение:
//  СправочникСсылка.Демо_КатегорииТоваров - категория товаров.
Функция ПолучитьИлиСоздатьКатегорию(Наименование)
	
	Ссылка = Справочники.Демо_КОД_КатегорииТоваров.НайтиПоНаименованию(Наименование, Истина);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Категория = Справочники.Демо_КОД_КатегорииТоваров.СоздатьЭлемент();
	Категория.Наименование = Наименование;
	Категория.Записать();
	
	Возврат Категория.Ссылка;
	
КонецФункции

// Возвращает существующий склад по наименованию или создает новый.
//
// Параметры:
//  Наименование - Строка - наименование склада.
//
// Возвращаемое значение:
//  СправочникСсылка.Демо_СкладыХранения - склад хранения.
Функция ПолучитьИлиСоздатьСклад(Наименование)
	
	Ссылка = Справочники.Демо_КОД_СкладыХранения.НайтиПоНаименованию(Наименование, Истина);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Склад = Справочники.Демо_КОД_СкладыХранения.СоздатьЭлемент();
	Склад.Наименование = Наименование;
	Склад.Записать();
	
	Возврат Склад.Ссылка;
	
КонецФункции

// Возвращает существующий товар по наименованию или создает новый.
//
// Параметры:
//  Наименование - Строка - наименование товара.
//  Категория - СправочникСсылка.Демо_КатегорииТоваров - категория товара.
//
// Возвращаемое значение:
//  СправочникСсылка.Демо_Товары - товар.
Функция ПолучитьИлиСоздатьТовар(Наименование, Категория)
	
	Ссылка = Справочники.Демо_КОД_Товары.НайтиПоНаименованию(Наименование, Истина);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Товар = Ссылка.ПолучитьОбъект();
	Иначе
		Товар = Справочники.Демо_КОД_Товары.СоздатьЭлемент();
	КонецЕсли;
	
	Товар.Наименование = Наименование;
	Товар.Категория = Категория;
	Товар.Записать();
	
	Возврат Товар.Ссылка;
	
КонецФункции

// Заполняет код и наименование текущего узла демо-плана обмена.
Процедура ЗаполнитьЭтотУзелПланаОбмена()
	
	ЭтотУзел = ПланыОбмена.Демо_КОД_ОбменСайтом.ЭтотУзел().ПолучитьОбъект();
	ЭтотУзел.Код = "ERP";
	ЭтотУзел.Наименование = "Демо ERP";
	ЭтотУзел.Записать();
	
КонецПроцедуры

// Заполняет существующий узел плана обмена по коду или создает новый.
//
// Параметры:
//  Код - Строка - код узла плана обмена.
//  Наименование - Строка - наименование узла плана обмена.
//  Склады - Массив из СправочникСсылка.Демо_СкладыХранения - склады, используемые для отбора.
Процедура ЗаполнитьУзелПланаОбмена(Код, Наименование, Склады)
	
	Ссылка = ПланыОбмена.Демо_КОД_ОбменСайтом.НайтиПоКоду(Код);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Узел = Ссылка.ПолучитьОбъект();
	Иначе
		Узел = ПланыОбмена.Демо_КОД_ОбменСайтом.СоздатьУзел();
	КонецЕсли;
	
	Узел.Код = Код;
	Узел.Наименование = Наименование;
	Узел.ОтборПоСкладам = Истина;
	Узел.Склады.Очистить();
	
	Для Каждого Склад Из Склады Цикл
		СтрокаСклада = Узел.Склады.Добавить();
		СтрокаСклада.Склад = Склад;
	КонецЦикла;
	
	Узел.Записать();
	
КонецПроцедуры

// Создает описание строки заказа.
//
// Параметры:
//  Товар - СправочникСсылка.Демо_Товары - товар строки заказа.
//  Количество - Число - количество товара.
//
// Возвращаемое значение:
//  Структура - товар и количество строки заказа.
Функция НоваяСтрокаЗаказа(Товар, Количество)
	
	Возврат Новый Структура("Товар, Количество", Товар, Количество);
	
КонецФункции

// Создает демо-заказ и при необходимости проводит его.
//
// Параметры:
//  Склад - СправочникСсылка.Демо_СкладыХранения - склад заказа.
//  СоставЗаказа - Массив из Структура - товары и количества заказа.
//  Проводить - Булево - признак проведения заказа.
Процедура СоздатьЗаказ(Склад, СоставЗаказа, Проводить)
	
	Заказ = Документы.Демо_Заказ.СоздатьДокумент();
	Заказ.Склад = Склад;
	Заказ.Дата = ТекущаяДата();
	
	Для Каждого ДанныеСтроки Из СоставЗаказа Цикл
		СтрокаЗаказа = Заказ.Товары.Добавить();
		СтрокаЗаказа.Товар = ДанныеСтроки.Товар;
		СтрокаЗаказа.Количество = ДанныеСтроки.Количество;
	КонецЦикла;
	
	Заказ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	
	Если Проводить Тогда
		Заказ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Заказ.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
